package com.liufan.learn.classtype;

import java.util.Arrays;

/**
 * 多维数组
 */
public class MultidimensionalArray extends LearnArray {

    /**
     * 二维数组
     */
    public static void twoDimensionalArray() {
        int[][] ns = {
                { 1, 2, 3, 4},
                { 5, 6, 7, 8 },
                { 9, 10, 11, 12 }
        };
        System.out.println(Arrays.deepToString(ns));

        int[] arr0 = ns[0];
        System.out.println(Arrays.toString(arr0));
        /*
                    arr0 ─────┐
                              ▼
                            ┌───┬───┬───┬───┐
                 ┌───┐  ┌──▶│ 1 │ 2 │ 3 │ 4 │
        ns ─────▶│░░░│──┘   └───┴───┴───┴───┘
                 ├───┤      ┌───┬───┬───┬───┐
                 │░░░│─────▶│ 5 │ 6 │ 7 │ 8 │
                 ├───┤      └───┴───┴───┴───┘
                 │░░░│──┐   ┌───┬───┬───┬───┐
                 └───┘  └──▶│ 9 │10 │11 │12 │
                            └───┴───┴───┴───┘
        访问二维数组的某个元素需要使用 array[row][col]
         */
        System.out.println(ns[1][2]); // 7
    }

    /**
     * 三维数组，就是二维数组的数组
     * <p>
     * 理论上，我们可以定义任意的 n 维数组。但在实际应用中，除了二维数组在某些时候还能用得上，更高维度的数组很少使用。
     */
    public static void threeDimensionalArray() {
        int[][][] ns = {
                {
                        {1, 2, 3},
                        {4, 5, 6},
                        {7, 8, 9}
                },
                {
                        {10, 11},
                        {12, 13}
                },
                {
                        {14, 15, 16},
                        {17, 18}
                }
        };
        /*
                                      ┌───┬───┬───┐
                           ┌───┐  ┌──▶│ 1 │ 2 │ 3 │
                       ┌──▶│░░░│──┘   └───┴───┴───┘
                       │   ├───┤      ┌───┬───┬───┐
                       │   │░░░│─────▶│ 4 │ 5 │ 6 │
                       │   ├───┤      └───┴───┴───┘
                       │   │░░░│──┐   ┌───┬───┬───┐
                ┌───┐  │   └───┘  └──▶│ 7 │ 8 │ 9 │
        ns ────▶│░░░│──┘              └───┴───┴───┘
                ├───┤      ┌───┐      ┌───┬───┐
                │░░░│─────▶│░░░│─────▶│10 │11 │
                ├───┤      ├───┤      └───┴───┘
                │░░░│──┐   │░░░│──┐   ┌───┬───┐
                └───┘  │   └───┘  └──▶│12 │13 │
                       │              └───┴───┘
                       │   ┌───┐      ┌───┬───┬───┐
                       └──▶│░░░│─────▶│14 │15 │16 │
                           ├───┤      └───┴───┴───┘
                           │░░░│──┐   ┌───┬───┐
                           └───┘  └──▶│17 │18 │
                                      └───┴───┘
         */
        System.out.println(Arrays.deepToString(ns));
    }
}
